# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 3 # number of classes

scales:
  n: [0.50, 0.50, 1024] # increased depth and width for small scale
  s: [0.50, 0.75, 1024] 
  m: [0.75, 1.00, 768]
  l: [1.00, 1.25, 512] 
  x: [1.25, 1.50, 512]

# YOLOv8.0n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 1]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 1]]   # 1-P2/4
  - [-1, 1, space_to_depth, [1]] # 2-P2/4
  - [-1, 3, C2f, [128, True]] 
  - [-1, 1, Conv, [256, 3, 1]]   # 4-P3/8
  - [-1, 1, space_to_depth, [1]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 1]]   # 7-P4/16  
  - [-1, 1, space_to_depth, [1]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 1]]  # 10-P5/32
  - [-1, 1, space_to_depth, [1]] 
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]     # 13

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 10], 1, Concat, [1]]  # cat backbone P5
  - [-1, 3, C2f, [512]]         # 16
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]   # cat backbone P4
  - [-1, 3, C2f, [256]]         # 19
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   
  - [[-1, 4], 1, Concat, [1]]   # cat backbone P3
  - [-1, 3, C2f, [128]]         # 22 (P3/8-small)
  
  - [19, 1, Conv, [256, 3, 1]]
  - [-1, 1, space_to_depth, [1]]
  - [[-1, 16], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]         # 26 (P4/16-medium)
   
  - [[22, 26, 16], 1, Detect, [nc]]  # Detect(P3, P4, P5)